/***************************************************************
 * \file       zh.h
 * \author     PATRICK LI (admin@aocrec.com)
 * \date       2022/11/8
 * \copyright  Copyright (c) 2020-2022
 ***************************************************************/

#include <map>
#include <string>

namespace zh {
    const std::map<uint32_t, std::string> kCivNames = {
            {0,  "随机"},
            {1,  "不列颠"},
            {2,  "法兰克"},
            {3,  "哥特"},
            {4,  "条顿"},
            {5,  "日本"},
            {6,  "中国"},
            {7,  "拜占庭"},
            {8,  "波斯"},
            {9,  "萨拉森"},
            {10, "土耳其"},
            {11, "维京"},
            {12, "蒙古"},
            {13, "凯尔特"},
            {14, "西班牙"},
            {15, "阿兹特克"},
            {16, "玛雅"},
            {17, "匈奴"},
            {18, "高丽"},
            {19, "意大利"},
            {20, "印度斯坦人"},
            {21, "印加"},
            {22, "马扎尔"},
            {23, "斯拉夫"},
            {24, "葡萄牙"},
            {25, "埃塞俄比亚"},
            {26, "马里"},
            {27, "柏柏尔"},
            {28, "高棉"},
            {29, "马来"},
            {30, "缅甸"},
            {31, "越南"},
            {32, "保加利亚"},
            {33, "鞑靼"},
            {34, "库曼"},
            {35, "立陶宛"},
            {36, "勃艮第"},
            {37, "西西里"},
            {38, "波兰人"},
            {39, "波希米亚人"},
            {40, "达罗毗荼人"},
            {41, "孟加拉人"},
            {42, "瞿折罗人"},
            {43, "ReservedCivL"},
            {44, "ReservedCivM"},
            {45, "ReservedCivN"},
            {46, "ReservedCivO"},
            {47, "ReservedCivP"},
            {48, "ReservedCivQ"}};

    const std::map<uint32_t, std::string> kPlayerTypes = {
            {0, "空缺"},
            {1, "关闭"},
            {2, "人类"},
            {3, "已被消灭"},
            {4, "AI"},
            {5, "旁观者"}};

    const std::map<uint32_t, std::string> kVictoryTypes = {
            {0,  "默认"},
            {1,  "征服"},
            {2,  "探索"},
            {4,  "圣物"},
            {7,  "时限"},
            {8,  "得分"},
            {9,  "标准"},
            {10, "弑君模式"},
            {11, "最后的存活者"}};

    const std::map<uint32_t, std::string> kVictoryAmount = {
            {15000, "1500 年 (2 小时)"},
            {13000, "1300 年 (105 分钟)"},
            {11000, "1100 年 (1.5 小时)"},
            {9000,  "900 年 (75 分钟)"},
            {7000,  "700 年 (60 分钟)"},
            {5000,  "500 年 (40 分钟)"},
            {3000,  "300 年 (25 分钟)"}};

    const std::map<uint32_t, std::string> kDifficulty = {
            {0, "极难"},
            {1, "难"}, // \todo DE中怎么选难是5？
            {2, "中等"},
            {3, "标准"},
            {4, "最易"},
            {5, "极限"},
    }; // \todo aoc-mgz 里有一个extreme

    const std::map<uint32_t, std::string> kResources = {
            {0, "标准"},
            {1, "低"},
            {2, "中"},
            {3, "高"},
            {4, "超高"},
            {5, "无限"},
            {6, "随机"}};

    const std::map<uint32_t, std::string> kSpeed = {
            {100,  "慢"},
            {150,  "正常"},
            {200,  "快"},
            {1000, "慢"},
            {1500, "随意"},
            {1690, "正常"},
            {2000, "快"}};

    const std::map<uint32_t, std::string> kRevealMap = {
            {0, "正常"},
            {1, "已探索"},
            {2, "全部可视"},
            {3, "无战雾"}};

    const std::map<uint32_t, std::string> kMapSize = {
            {0, "微型 (2 个玩家)"},
            {1, "小型 (3 个玩家)"},
            {2, "中型 (4 个玩家)"},
            {3, "正常 (6 个玩家)"},
            {4, "大型 (8 个玩家)"},
            {5, "巨型"},
            {6, "超大"}};
}