/**
 * \file       zh.h
 * \author     PATRICK LI (admin@aocrec.com)
 * \brief
 * \version    0.1
 * \date       2022-10-05
 *
 * \copyright  Copyright (c) 2020-2022
 *
 */

#include <map>
#include <string>

using namespace std;

namespace zh
{
    const map<uint32_t, string> civNames = {
        {0, "随机"},
        {1, "不列颠"},
        {2, "法兰克"},
        {3, "哥特"},
        {4, "条顿"},
        {5, "日本"},
        {6, "中国"},
        {7, "拜占庭"},
        {8, "波斯"},
        {9, "萨拉森"},
        {10, "土耳其"},
        {11, "维京"},
        {12, "蒙古"},
        {13, "凯尔特"},
        {14, "西班牙"},
        {15, "阿兹特克"},
        {16, "玛雅"},
        {17, "匈奴"},
        {18, "高丽"},
        {19, "意大利"},
        {20, "印度斯坦人"},
        {21, "印加"},
        {22, "马扎尔"},
        {23, "斯拉夫"},
        {24, "葡萄牙"},
        {25, "埃塞俄比亚"},
        {26, "马里"},
        {27, "柏柏尔"},
        {28, "高棉"},
        {29, "马来"},
        {30, "缅甸"},
        {31, "越南"},
        {32, "保加利亚"},
        {33, "鞑靼"},
        {34, "库曼"},
        {35, "立陶宛"},
        {36, "勃艮第"},
        {37, "西西里"},
        {38, "波兰人"},
        {39, "波希米亚人"},
        {40, "达罗毗荼人"},
        {41, "孟加拉人"},
        {42, "瞿折罗人"},
        {43, "ReservedCivL"},
        {44, "ReservedCivM"},
        {45, "ReservedCivN"},
        {46, "ReservedCivO"},
        {47, "ReservedCivP"},
        {48, "ReservedCivQ"}};

    const map<uint32_t, string> playerTypes = {
        {0, "空缺"},
        {1, "关闭"},
        {2, "人类"},
        {3, "已被消灭"},
        {4, "机器人"},
        {5, "旁观者"}};

    const map<uint32_t, string> victoryTypes = {
        {0, "默认"},
        {1, "征服"},
        {2, "探索"},
        {4, "圣物"},
        {7, "时限"},
        {8, "得分"},
        {9, "标准"},
        {10, "弑君模式"},
        {11, "最后的存活者"}};

    const map<uint32_t, string> victoryAmount = {
        {15000, "1500 年 (2 小时)"},
        {13000, "1300 年 (105 分钟)"},
        {11000, "1100 年 (1.5 小时)"},
        {9000, "900 年 (75 分钟)"},
        {7000, "700 年 (60 分钟)"},
        {5000, "500 年 (40 分钟)"},
        {3000, "300 年 (25 分钟)"}};
}